; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	spectrograph1 - mode
	image0 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star2 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 spectrograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument9 spectrograph1)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 spectrograph1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(have_image Star5 image0)
	(have_image Planet6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Planet8 image0)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon11 image0)
	(have_image Planet12 spectrograph1)
	(have_image Star13 image0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 9
2. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 0 of 9
3. (turn_to satellite4 planet6 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 planet6)
   goals met: 0 of 9
4. (take_image satellite4 planet6 instrument10 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 1 of 9
5. (turn_to satellite4 planet12 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet12)
   goals met: 1 of 9
6. (take_image satellite4 planet12 instrument10 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 2 of 9
7. (turn_to satellite4 phenomenon9 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon9)
   goals met: 2 of 9
8. (take_image satellite4 phenomenon9 instrument10 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 3 of 9
9. (turn_to satellite4 phenomenon11 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon11)
   goals met: 3 of 9
10. (take_image satellite4 phenomenon11 instrument10 image0)
   added: (have_image phenomenon11 image0)
   goals met: 4 of 9
11. (turn_to satellite4 phenomenon10 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon10)
   goals met: 4 of 9
12. (take_image satellite4 phenomenon10 instrument10 image0)
   added: (have_image phenomenon10 image0)
   goals met: 5 of 9
13. (turn_to satellite4 planet8 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet8)
   goals met: 5 of 9
14. (take_image satellite4 planet8 instrument10 image0)
   added: (have_image planet8 image0)
   goals met: 6 of 9
15. (turn_to satellite4 star13 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star13)
   goals met: 6 of 9
16. (take_image satellite4 star13 instrument10 image0)
   added: (have_image star13 image0)
   goals met: 7 of 9
17. (turn_to satellite4 star5 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star5)
   goals met: 7 of 9
18. (take_image satellite4 star5 instrument10 image0)
   added: (have_image star5 image0)
   goals met: 8 of 9
19. (turn_to satellite4 star7 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star7)
   goals met: 8 of 9
20. (take_image satellite4 star7 instrument10 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 9 of 9
